package by.htp.part01.block1;

/*
 * 2. Найдите значение функции: с = 3 + а.
 */
public class Ex02 {

	public static void main(String[] args) {		
		int a = 10;
		int c = 3 + a;

		System.out.println("Значение функции = " + c);
	}

}
