package by.htp.part01.block1;

/*
 * 7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника
 */
public class Ex07 {

	public static void main(String[] args) {
		int a = 12;
		int e = a * 2;

		int per = 2 * (a + e);

		System.out.println(per);
	}
}
