package by.htp.part01.block1;

/*
 * 9. Вычислить значение выражения по формуле (все переменные принимают действительные значения):
 */
public class Ex09 {

	public static void main(String[] args) {
		int a = 24;
		int c = 12;
		int b = 4;
		int d = 2;

		int z = (a / c) * (b / d) - (a * b - c) / c * d;

		System.out.println(z);
	}
}
