package by.htp.part01.block2;

/*
 * 1. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран цифру 7,
 *  в противном случае – цифру 8.
 */
public class Ex01 {

	public static void main(String[] args) {
		int c = 1;
		int a = 2;

		if (c < a) {
			System.out.println(7);
		} else {
			System.out.println(8);
		}

	}
}
