package by.htp.part01.block2;

/*
 * 2. Составить программу сравнения двух чисел 1 и 2. Если 1 меньше 2 – вывести на экран
 *  слово «yes», в противном случае – слово «no»
 */
public class Ex02 {

	public static void main(String[] args) {
		int c = 1;
		int a = 2;
		
		if (c < a) {
			System.out.println("yes");
		} else {
			System.out.println("no");
		}
	}
}
